Revit 2027 API
Parameter.DissociateFromGlobalParameter Method
 Dissociates this parameter from a global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DissociateFromGlobalParameter()
Public Sub DissociateFromGlobalParameter
public:
void DissociateFromGlobalParameter()
member DissociateFromGlobalParameter : unit -> unit
Exceptions
Exception | Condition
ArgumentException |  This parameter does not exist in the document anymore. -or- This parameter is either not parameterizable or does not match the type of the global parameter.
Remarks
 It is assumed this parameter has been previously associated with the global parameter by using the [!:AssociateWithGlobalParameter(Revit::DB::ElementId^)] method.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace